Обработки/Reports/_ЖурналУчетаИмуществаПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЖурналУчетаИмуществаПИФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьШапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЖурналУчетаИмуществаПИФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Журнал учета имущества ПИФ",
		"1.85",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Пропущенные операции в сравнении с отчетом в 7.7:
	// 17. Получение дивидендов. Документы такого вида пока не реализованы в 8
	// 19. Получение средств при погашении облигации - учтена в операции 16. 
	// 20. Оплата публикации. Реализовано просто начисление кредиторкой задолженности по прочим услугам
	// 22. Перевод денег пайщиков с транзитного счета. Реализовано вместе с операцией 10 (Приход денежных средств на приобретение паев)
	
	
	// ДатаР ВремяР  - дата регистрации
	// ДатаП ВремяП  - Дата поведения
	// ДатаС ВремяС  - дата согласия СД
	// ВидОперации
	// Имущество
	// Количество
	// Сумма
	//
	// Документ НомерД ДатаД - наименование, номер и дата документа, направленного спецдепозитарию
	
	//1.
	// Биржевая покупка
	// Биржевая продажа
	// Оплата комиссии биржи
	
	// 3. 
	// Заключение внебиржевой собственной или брокерской сделки
	
	// 4.
	// Оплата внебиржевой брокерской или собственной сделки
	
	// 5.
	// Перерегистрация ЦБ по внебиржевой брокерской сделке,
	// Перерегистрация ЦБ по внебиржевой собственной сделке
	
	// 6.
	// Оплата комиссии брокера по внебиржевой брокерской сделке,
	// Оплата комиссии брокера по внебиржевой собственной сделке
	
	// 7.
	// Оплата вознаграждения УК
	
	// 8.
	// Оплата вознаграждения Специализированного депозитария за месяц,
	// Оплата за депозитарные услуги за месяц и т.д.
	
 	// 9.
	// Перевод денежных средств брокеру
	
	// 10.
	// Приход денежных средств на приобретение паев

	// 11.
	// Зачисление паев пайщику
	
	// 12.
	// Погашение паев пайщику
	
	// 13.
	// Выплата денежной компенсации за паи
	
	// 14.
	// Перечисление НДФЛ при выплате компенсации за паи
	
	// 15.
	// Погашение купона (начисление дебиторской задолженности)
	
	// 16.
	// Получение купонного дохода, получение дивидендов по акциям
			
	// 18.
	// Погашение облигации
	
	// 19.
	// Получение денежных средств по погашению облигации
	
	// 20.	
	// Оплата публикации
	
	// 21.
	// Ввод денежных средств, вывод денежных средств
	
	// 22.
	//Перевод денег пайщиков с транзитного счета

	// 23.
	//Начисление резерва

	// 24.
	//Начисление резерва

	// 25.
	// Ввод ценных бумаг

	// 26.
	// Ввод депозитов

	// 27.
	// Завешивание кредиторки

	// 28.
	//приход процентов МНО

	// 29.
 	//Закрытие Депозитного вклада

	// 30.
	//РазмещениеДепозитногоВклада  

	// 31.
	// Покупка/продажа валюты

	// 31.
	// Покупка/продажа валюты

	//32_ПрочаяДебиторскаяЗадолженность
	//33_ПрочиеПриходы
	//34_НачислениеДивидендов
	//35_ОплатаЦБ
	//36_ПокупкаПродажаВалютыСОтложеннымИсполнением
	//37_ВыводыЦенныхБумаг
	//38_ВыводДепозита
	//39_СписанияЦенныхБумаг
	//40_ВыводыПрочихАктивов
	
//"ДФ=yyyyMMdd"
	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.ПаевойИнвестиционныйФонд, , КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	
	Настройки = КомпоновщикНастроек.Настройки;

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Биржа", 							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 					НачалоДня(ЭтотОбъект.Период.ДатаНачала));
		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериодаДата", 				Формат(ЭтотОбъект.Период.ДатаНачала,    "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериодаДата", 				Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	
	// Параметры для заполнения шапки
	ВидыСводныхОпераций = Новый Массив;
	ВидыСводныхОпераций.Добавить(Перечисления.ВидыОперацийБэкОфиса.СводнаяБиржеваяСделка);
	ВидыСводныхОпераций.Добавить(Перечисления.ВидыОперацийБэкОфиса.СводноеИсполнениеОбязательствПоБиржевымСделкам);
	
	ПараметрыШапки = ПолучитьПараметрыШапки();
	
	Если ПараметрыШапки = Неопределено Тогда
		Если Не (ЗначениеЗаполнено(ЭтотОбъект.ПаевойИнвестиционныйФонд) ИЛИ ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления)) Тогда
			ТекстСообщения = "В параметрах отчета не выбран ПИФ";
		Иначе
			ТекстСообщения = СокрЛП(?(ЭтотОбъект.ПаевойИнвестиционныйФонд = Справочники.ПаевыеИнвестиционныеФонды.ПустаяСсылка(), ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ПаевойИнвестиционныйФонд)) + " отсутствует в счетах ДУ на дату " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПаевойИнвестиционныйФонд", 		ПараметрыШапки.ПИФ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеФонда", 				ПараметрыШапки.НаименованиеФонда);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеУК", 				ПараметрыШапки.НаименованиеУК);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерЛицензии", 					ПараметрыШапки.НомерЛицензии);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаЛицензии", 					Формат(ПараметрыШапки.ДатаЛицензии, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПравил", 					Формат(ПараметрыШапки.ДатаПравил, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерПравил", 					ПараметрыШапки.НомерПравил);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаВремяОтчета", 				ПараметрыШапки.ДатаВремяОтчета);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОрганУтвердившийПравила", 		"Правила доверительного управления фондом от");
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыСводныхОпераций", 			ВидыСводныхОпераций);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипПИФ", 						ПараметрыШапки.ТипПИФ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаУчета", 					ПараметрыШапки.ВалютаУчета);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	//ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	   	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей);

КонецПроцедуры

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ВалютаУчета КАК ВалютаУчета
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			ВЫБОР
		|					КОГДА &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)
		|						ТОГДА (ВЫРАЗИТЬ(Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = &ПаевойИнвестиционныйФонд
		|					ИНАЧЕ СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				КОНЕЦ
		|				И СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
		|	&Период КАК ДатаВремяОтчета,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензии,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Номер КАК НомерЛицензии,
		|	_КлиентДоверительногоУправления.Клиент.НомерПравил КАК НомерПравил,
		|	_КлиентДоверительногоУправления.Клиент.ДатаПравил КАК ДатаПравил,
		|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК НаименованиеФонда,
		|	_КлиентДоверительногоУправления.Клиент КАК ПИФ,
		|	_КлиентДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КлиентДоверительногоУправления.ВалютаУчета КАК ВалютаУчета,
		|	_КлиентДоверительногоУправления.Клиент.Тип КАК ТипПИФ
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации		
		|		 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)) КАК СтатусыЛицензийОрганизацииСрезПоследних
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ЮрФизЛицо,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления, 
		|	РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ПаевойИнвестиционныйФонд В (ВЫБРАТЬ _КлиентДоверительногоУправления.Клиент ИЗ _КлиентДоверительногоУправления)) КАК РеквизитыПИФСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПриКомпоновкеРезультата(ДокументРезультат, Неопределено, Ложь);
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры
